In [34]:
import pandas as pd
import numpy as np

In [36]:
a=pd.DataFrame(np.arange(0,20).reshape(4,5),index=['row1','row2','row3','row4'],columns=['column1','column2','column3','column4','column5'])

In [37]:
a

      column1  column2  column3  column4  column5
row1        0        1        2        3        4
row2        5        6        7        8        9
row3       10       11       12       13       14
row4       15       16       17       18       19

In [46]:
a.loc['row1']
type(a.loc['row1'])

pandas.core.series.Series

In [32]:
d=pd.read_excel("C://Users//Ajay//iris.xlsx")

In [53]:
d.iloc[0:3,0:4]
type(a.iloc[0:4,0:5])

pandas.core.frame.DataFrame

In [33]:
d

      sl   sw   pl   pw           class
0    5.1  3.5  1.4  0.2     Iris-setosa
1    4.9  3.0  1.4  0.2     Iris-setosa
2    4.7  3.2  1.3  0.2     Iris-setosa
3    4.6  3.1  1.5  0.2     Iris-setosa
4    5.0  3.6  1.4  0.2     Iris-setosa
..   ...  ...  ...  ...             ...
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

[150 rows x 5 columns]

In [38]:
d.to_csv('iris.csv')

In [52]:
d.iloc[0:5,0:5]

    sl   sw   pl   pw        class
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

In [55]:
d.iloc[:,:].values.shape

(150, 5)

In [61]:
d.sum().isnull()

sl       False
sw       False
pl       False
pw       False
class    False
dtype: bool

In [63]:
d['sl'].value_counts()

5.0    10
5.1     9
6.3     9
5.7     8
6.7     8
5.8     7
5.5     7
6.4     7
4.9     6
5.4     6
6.1     6
6.0     6
5.6     6
4.8     5
6.5     5
6.2     4
7.7     4
6.9     4
4.6     4
5.2     4
5.9     3
4.4     3
7.2     3
6.8     3
6.6     2
4.7     2
7.6     1
7.4     1
7.3     1
7.0     1
7.1     1
5.3     1
4.3     1
4.5     1
7.9     1
Name: sl, dtype: int64

In [64]:
d['sl'].unique()

array([5.1, 4.9, 4.7, 4.6, 5. , 5.4, 4.4, 4.8, 4.3, 5.8, 5.7, 5.2, 5.5,
       4.5, 5.3, 7. , 6.4, 6.9, 6.5, 6.3, 6.6, 5.9, 6. , 6.1, 5.6, 6.7,
       6.2, 6.8, 7.1, 7.6, 7.3, 7.2, 7.7, 7.4, 7.9])

In [65]:
pd.read_csv('iris.csv')

     Unnamed: 0   sl   sw   pl   pw           class
0             0  5.1  3.5  1.4  0.2     Iris-setosa
1             1  4.9  3.0  1.4  0.2     Iris-setosa
2             2  4.7  3.2  1.3  0.2     Iris-setosa
3             3  4.6  3.1  1.5  0.2     Iris-setosa
4             4  5.0  3.6  1.4  0.2     Iris-setosa
..          ...  ...  ...  ...  ...             ...
145         145  6.7  3.0  5.2  2.3  Iris-virginica
146         146  6.3  2.5  5.0  1.9  Iris-virginica
147         147  6.5  3.0  5.2  2.0  Iris-virginica
148         148  6.2  3.4  5.4  2.3  Iris-virginica
149         149  5.9  3.0  5.1  1.8  Iris-virginica

[150 rows x 6 columns]

In [68]:
d['sl'].sample()

33    5.5
Name: sl, dtype: float64

In [72]:
d[d['sl']>7.5]

      sl   sw   pl   pw           class
105  7.6  3.0  6.6  2.1  Iris-virginica
117  7.7  3.8  6.7  2.2  Iris-virginica
118  7.7  2.6  6.9  2.3  Iris-virginica
122  7.7  2.8  6.7  2.0  Iris-virginica
131  7.9  3.8  6.4  2.0  Iris-virginica
135  7.7  3.0  6.1  2.3  Iris-virginica

In [73]:
d.head()

    sl   sw   pl   pw        class
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

In [74]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sl      150 non-null    float64
 1   sw      150 non-null    float64
 2   pl      150 non-null    float64
 3   pw      150 non-null    float64
 4   class   150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [75]:
d.describe()

               sl          sw          pl          pw
count  150.000000  150.000000  150.000000  150.000000
mean     5.843333    3.054000    3.758667    1.198667
std      0.828066    0.433594    1.764420    0.763161
min      4.300000    2.000000    1.000000    0.100000
25%      5.100000    2.800000    1.600000    0.300000
50%      5.800000    3.000000    4.350000    1.300000
75%      6.400000    3.300000    5.100000    1.800000
max      7.900000    4.400000    6.900000    2.500000